# **ESERCIZI LEZIONE 5**

### ***1. RISPONDERE ALLE DOMANDE***

In [2]:
import pandas as pd

sales = pd.DataFrame(
    data={
        "employee": [
            "Katrina",
            "Guanyu",
            "Jan",
            "Roman",
            "Jacqueline",
            "Paola",
            "Esperanza",
            "Alaina",
            "Egweyn",
        ],
        "sales": [14, 17, 6, 12, 8, 3, 7, 15, 5],
        "year": [2018, 2019, 2020, 2018, 2020, 2019, 2019, 2020, 2020],
    }
)
sales

     employee  sales  year
0     Katrina     14  2018
1      Guanyu     17  2019
2         Jan      6  2020
3       Roman     12  2018
4  Jacqueline      8  2020
5       Paola      3  2019
6   Esperanza      7  2019
7      Alaina     15  2020
8      Egweyn      5  2020

In [4]:
sales[sales["sales"] > 10]

  employee  sales  year
0  Katrina     14  2018
1   Guanyu     17  2019
3    Roman     12  2018
7   Alaina     15  2020

In [5]:
sales[sales["year"]==2018]

  employee  sales  year
0  Katrina     14  2018
3    Roman     12  2018

In [11]:
sales[(sales["year"]!=2018) & (sales["sales"] <= 13)]

     employee  sales  year
2         Jan      6  2020
4  Jacqueline      8  2020
5       Paola      3  2019
6   Esperanza      7  2019
8      Egweyn      5  2020

In [12]:
sales[(sales["sales"] / 3 ) > 3]

  employee  sales  year
0  Katrina     14  2018
1   Guanyu     17  2019
3    Roman     12  2018
7   Alaina     15  2020

In [15]:
sales[sales["employee"] > "J"]

     employee  sales  year
0     Katrina     14  2018
2         Jan      6  2020
3       Roman     12  2018
4  Jacqueline      8  2020
5       Paola      3  2019

### ***2. ANALISI DI UN DATASET DI VIDEOGIOCHI***